#############################################################
# | cafe       | http://cafe.naver.com/dremdelover          |
# | Q&A        | https://open.kakao.com/o/gX0WnTCf          |
# | business   | ultrasuperrok@gmail.com                    |
#############################################################

# 변수(Variable)는 프로그래밍에서 데이터를 저장하는 메모리의 이름이 할당된 공간입니다. 파이썬에서는 다양한 유형의 데이터를 저장할 수 있으며,
# 변수 이름은 그 데이터를 참조하는데 사용됩니다.
# 변수를 선언하려면, 이름을 선택하고 등호(=) 기호를 사용하여 값을 할당합니다.

# 예제 1: 정수형 변수
# 여기서 'age'는 변수 이름이고, 20은 그 변수에 할당된 값입니다.
age = 20
print(age) # 이 코드는 변수 'age'의 값을 출력합니다.

# 예제 2: 문자열 변수
# 여기서 'name'은 변수 이름이고, "John"은 그 변수에 할당된 값입니다.
name = "John"
print(name) # 이 코드는 변수 'name'의 값을 출력합니다.

# 예제 3: 부동소수점 변수
# 여기서 'height'는 변수 이름이고, 5.9는 그 변수에 할당된 값입니다.
height = 5.9
print(height) # 이 코드는 변수 'height'의 값을 출력합니다.

# 예제 4: 불리언 변수
# 여기서 'is_student'는 변수 이름이고, True는 그 변수에 할당된 값입니다.
is_student = True
print(is_student) # 이 코드는 변수 'is_student'의 값을 출력합니다.

# 변수 이름은 언더스코어(_) 또는 알파벳으로 시작해야하며, 숫자로 시작할 수 없습니다.
# 또한, 변수 이름은 공백을 포함할 수 없으며, 파이썬의 키워드(예: if, else, for 등)를 사용할 수 없습니다.
